In [28]:
import pandas as pd
import matplotlib.pyplot as plt
from sklearn.preprocessing import LabelEncoder

In [29]:
def read_files():
    xlsx = pd.ExcelFile('ArriendoVehiculos.xlsx')

    df_set_1 = pd.read_excel(xlsx, 'Set de Datos 1', engine='openpyxl', index_col=None)
    df_set_2 = pd.read_excel(xlsx, 'Set de Datos 2', engine='openpyxl', index_col=None)
    df_set_3 = pd.read_excel(xlsx, 'Set de Datos 3', engine='openpyxl', index_col=None)
    
    return df_set_1, df_set_2, df_set_3

In [30]:
def show_df_info(df):
    print(df.info())
    display(df.head())
    display(df.describe())

In [38]:
def transf_datos(df):
    encoder = LabelEncoder()
    df["enc_genero"] = encoder.fit_transform(df["GÉNERO"])
    df["enc_act"] = encoder.fit_transform(df["ACTIVIDAD"])
    df["enc_marca"] = encoder.fit_transform(df["MARCA"])
    df["enc_modelo"] = encoder.fit_transform(df["MODELO"].apply(lambda x: str(x)))
    df["enc_comuna"] = encoder.fit_transform(df["COMUNA DE RESIDENCIA"])
    
    # Drop the encoded categorical columns
    
    df.drop(["GÉNERO", "ACTIVIDAD", "MARCA", "MODELO", "COMUNA DE RESIDENCIA"], axis=1, inplace=True)
    return df

In [39]:
df_set_1, df_set_2, df_set_3 = read_files()

df_set_1 = transf_datos(df_set_1)
df_set_2 = transf_datos(df_set_2)
df_set_3 = transf_datos(df_set_3)

show_df_info(df_set_1)
show_df_info(df_set_2)
show_df_info(df_set_3)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 10 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   EDAD                 49 non-null     float64
 1   KILOMETRAJE INICIAL  50 non-null     int64
 2   KILOMETRAJE FINAL    50 non-null     int64
 3   CANTIDAD DIAS        49 non-null     float64
 4   MONTO                50 non-null     int64
 5   enc_genero           50 non-null     int32
 6   enc_act              50 non-null     int32
 7   enc_marca            50 non-null     int32
 8   enc_modelo           50 non-null     int32
 9   enc_comuna           50 non-null     int32
dtypes: float64(2), int32(5), int64(3)
memory usage: 3.1 KB
None

,EDAD,KILOMETRAJE INICIAL,KILOMETRAJE FINAL,CANTIDAD DIAS,MONTO,enc_genero,enc_act,enc_marca,enc_modelo,enc_comuna
0,36.0,2732,2866,4.0,80000,1,2,10,18,4
1,29.0,2471,2637,3.0,30000,0,0,1,3,7
2,54.0,3903,4092,4.0,80000,0,0,2,12,0
3,70.0,4196,4253,3.0,60000,0,0,4,16,3
4,39.0,3113,3318,5.0,100000,0,0,4,2,6

,EDAD,KILOMETRAJE INICIAL,KILOMETRAJE FINAL,CANTIDAD DIAS,MONTO,enc_genero,enc_act,enc_marca,enc_modelo,enc_comuna
count,49.000000,50.000000,50.000000,49.000000,5.000000e+01,50.000000,50.000000,50.000000,50.000000,50.000000
mean,49.775510,3216.580000,3342.980000,2.530612,2.912060e+05,0.400000,0.260000,5.420000,9.880000,4.300000
std,15.260605,590.127938,579.413197,1.385972,1.690145e+06,0.494872,0.664247,3.417183,5.794579,3.124949
min,18.000000,2197.000000,2318.000000,1.000000,-2.000000e+04,0.000000,0.000000,0.000000,0.000000,0.000000
25%,37.000000,2770.500000,2871.250000,1.000000,2.000000e+04,0.000000,0.000000,3.000000,5.000000,1.000000
50%,53.000000,3200.500000,3333.000000,2.000000,4.500000e+04,0.000000,0.000000,5.000000,11.000000,5.000000
75%,62.000000,3645.750000,3774.500000,4.000000,8.000000e+04,1.000000,0.000000,8.750000,15.000000,7.000000
max,75.000000,4201.000000,4305.000000,5.000000,1.200000e+07,1.000000,3.000000,12.000000,18.000000,8.000000

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 10 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Unnamed: 0           50 non-null     int64
 1   KILOMETRAJE INICIAL  50 non-null     int64
 2   KILOMETRAJE FINAL    50 non-null     int64
 3   CANTIDAD DIAS        50 non-null     int64
 4   MONTO                50 non-null     int64
 5   enc_genero           50 non-null     int32
 6   enc_act              50 non-null     int32
 7   enc_marca            50 non-null     int32
 8   enc_modelo           50 non-null     int32
 9   enc_comuna           50 non-null     int32
dtypes: int32(5), int64(5)
memory usage: 3.1 KB
None

,Unnamed: 0,KILOMETRAJE INICIAL,KILOMETRAJE FINAL,CANTIDAD DIAS,MONTO,enc_genero,enc_act,enc_marca,enc_modelo,enc_comuna
0,52,2186,2288,2,20000,1,1,4,16,4
1,47,2916,3011,2,40000,1,0,11,14,5
2,25,2356,2427,3,30000,0,0,5,11,3
3,22,3464,3684,4,120000,0,0,11,14,8
4,58,4080,4157,4,80000,1,2,10,19,5

,Unnamed: 0,KILOMETRAJE INICIAL,KILOMETRAJE FINAL,CANTIDAD DIAS,MONTO,enc_genero,enc_act,enc_marca,enc_modelo,enc_comuna
count,50.000000,50.000000,50.000000,50.000000,50.000000,50.000000,50.000000,50.000000,50.000000,50.00000
mean,45.600000,3132.560000,3239.000000,2.940000,62400.000000,0.580000,0.920000,7.120000,10.360000,4.90000
std,19.822683,636.723378,647.680634,1.503873,49551.457484,0.537948,1.006915,3.745147,4.964198,2.60494
min,12.000000,2172.000000,2221.000000,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.00000
25%,30.250000,2637.750000,2737.250000,2.000000,20000.000000,0.000000,0.000000,4.000000,7.000000,3.25000
50%,46.000000,3082.500000,3151.000000,3.000000,40000.000000,1.000000,0.500000,8.500000,10.000000,5.00000
75%,58.000000,3706.500000,3801.000000,4.000000,100000.000000,1.000000,2.000000,10.000000,14.000000,7.00000
max,124.000000,4213.000000,4305.000000,5.000000,150000.000000,2.000000,3.000000,12.000000,19.000000,9.00000

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 10 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   EDAD                 50 non-null     int64
 1   KILOMETRAJE INICIAL  50 non-null     int64
 2   KILOMETRAJE FINAL    50 non-null     int64
 3   CANTIDAD DIAS        50 non-null     int64
 4   MONTO                50 non-null     int64
 5   enc_genero           50 non-null     int32
 6   enc_act              50 non-null     int32
 7   enc_marca            50 non-null     int32
 8   enc_modelo           50 non-null     int32
 9   enc_comuna           50 non-null     int32
dtypes: int32(5), int64(5)
memory usage: 3.1 KB
None

,EDAD,KILOMETRAJE INICIAL,KILOMETRAJE FINAL,CANTIDAD DIAS,MONTO,enc_genero,enc_act,enc_marca,enc_modelo,enc_comuna
0,36,3201,3265,1,30000,0,0,3,7,3
1,29,2399,2563,4,120000,0,0,3,7,0
2,54,3266,3385,3,90000,2,0,2,10,8
3,70,3965,4022,1,-20000,2,0,9,6,9
4,39,2642,2847,2,40000,2,0,6,1,3

,EDAD,KILOMETRAJE INICIAL,KILOMETRAJE FINAL,CANTIDAD DIAS,MONTO,enc_genero,enc_act,enc_marca,enc_modelo,enc_comuna
count,50.000000,50.000000,50.000000,50.000000,5.000000e+01,50.00000,50.000000,50.000000,50.000000,50.000000
mean,48.780000,3176.980000,3291.080000,2.840000,9.540200e+04,1.52000,0.640000,6.440000,8.680000,4.640000
std,16.770102,522.549226,525.526474,1.503194,2.506898e+05,1.19932,0.920514,3.850046,4.644242,3.160728
min,12.000000,2258.000000,2358.000000,1.000000,-2.000000e+04,0.00000,0.000000,0.000000,0.000000,0.000000
25%,34.500000,2791.250000,2924.000000,1.000000,2.000000e+04,0.00000,0.000000,3.250000,5.250000,2.000000
50%,49.000000,3195.000000,3266.000000,3.000000,5.000000e+04,1.50000,0.000000,6.500000,8.000000,5.000000
75%,62.750000,3624.250000,3745.250000,4.000000,9.000000e+04,3.00000,1.750000,10.000000,12.000000,7.750000
max,75.000000,4146.000000,4262.000000,5.000000,1.800000e+06,3.00000,3.000000,12.000000,17.000000,9.000000

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 10 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   EDAD                  49 non-null     float64
 1   GÉNERO                50 non-null     object
 2   ACTIVIDAD             49 non-null     object
 3   COMUNA DE RESIDENCIA  50 non-null     object
 4   MARCA                 49 non-null     object
 5   MODELO                50 non-null     object
 6   KILOMETRAJE INICIAL   50 non-null     int64
 7   KILOMETRAJE FINAL     50 non-null     int64
 8   CANTIDAD DIAS         49 non-null     float64
 9   MONTO                 50 non-null     int64
dtypes: float64(2), int64(3), object(5)
memory usage: 4.0+ KB
None

,EDAD,GÉNERO,ACTIVIDAD,COMUNA DE RESIDENCIA,MARCA,MODELO,KILOMETRAJE INICIAL,KILOMETRAJE FINAL,CANTIDAD DIAS,MONTO
0,36.0,MASCULINO,ESTUDIANTE,QUILLOTA,SUBARU,XV,2732,2866,4.0,80000
1,29.0,FEMENINO,DEPENDIENTE,VILLA ALEMANA,CITROEN,BERLINGO,2471,2637,3.0,30000
2,54.0,FEMENINO,DEPENDIENTE,CASABLANCA,FIAT,FULLBACK,3903,4092,4.0,80000
3,70.0,FEMENINO,DEPENDIENTE,OLMUE,HYUNDAY,SANTA FE,4196,4253,3.0,60000
4,39.0,FEMENINO,DEPENDIENTE,VALPARAISO,HYUNDAY,ACCENT,3113,3318,5.0,100000

,EDAD,KILOMETRAJE INICIAL,KILOMETRAJE FINAL,CANTIDAD DIAS,MONTO
count,49.000000,50.000000,50.000000,49.000000,5.000000e+01
mean,49.775510,3216.580000,3342.980000,2.530612,2.912060e+05
std,15.260605,590.127938,579.413197,1.385972,1.690145e+06
min,18.000000,2197.000000,2318.000000,1.000000,-2.000000e+04
25%,37.000000,2770.500000,2871.250000,1.000000,2.000000e+04
50%,53.000000,3200.500000,3333.000000,2.000000,4.500000e+04
75%,62.000000,3645.750000,3774.500000,4.000000,8.000000e+04
max,75.000000,4201.000000,4305.000000,5.000000,1.200000e+07

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 10 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Unnamed: 0            50 non-null     int64
 1   GÉNERO                49 non-null     object
 2   ACTIVIDAD             48 non-null     object
 3   COMUNA DE RESIDENCIA  50 non-null     object
 4   MARCA                 47 non-null     object
 5   MODELO                50 non-null     object
 6   KILOMETRAJE INICIAL   50 non-null     int64
 7   KILOMETRAJE FINAL     50 non-null     int64
 8   CANTIDAD DIAS         50 non-null     int64
 9   MONTO                 50 non-null     int64
dtypes: int64(5), object(5)
memory usage: 4.0+ KB
None

,Unnamed: 0,GÉNERO,ACTIVIDAD,COMUNA DE RESIDENCIA,MARCA,MODELO,KILOMETRAJE INICIAL,KILOMETRAJE FINAL,CANTIDAD DIAS,MONTO
0,52,MUJER,EMPRESARIO,QUILLOTA,HYUNDAY,SANTA FE,2186,2288,2,20000
1,47,MUJER,DEPENDIENTE,QUILPUE,SUZUKI,NOMADE,2916,3011,2,40000
2,25,HOMBRE,DEPENDIENTE,OLMUE,KIA,FRONTIER,2356,2427,3,30000
3,22,HOMBRE,DEPENDIENTE,VILLA ALEMANA,SUZUKI,NOMADE,3464,3684,4,120000
4,58,MUJER,ESTUDIANTE,QUILPUE,SUBARU,XV,4080,4157,4,80000

,Unnamed: 0,KILOMETRAJE INICIAL,KILOMETRAJE FINAL,CANTIDAD DIAS,MONTO
count,50.000000,50.000000,50.000000,50.000000,50.000000
mean,45.600000,3132.560000,3239.000000,2.940000,62400.000000
std,19.822683,636.723378,647.680634,1.503873,49551.457484
min,12.000000,2172.000000,2221.000000,1.000000,0.000000
25%,30.250000,2637.750000,2737.250000,2.000000,20000.000000
50%,46.000000,3082.500000,3151.000000,3.000000,40000.000000
75%,58.000000,3706.500000,3801.000000,4.000000,100000.000000
max,124.000000,4213.000000,4305.000000,5.000000,150000.000000

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 10 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   EDAD                  50 non-null     int64
 1   GÉNERO                50 non-null     object
 2   ACTIVIDAD             49 non-null     object
 3   COMUNA DE RESIDENCIA  50 non-null     object
 4   MARCA                 47 non-null     object
 5   MODELO                50 non-null     object
 6   KILOMETRAJE INICIAL   50 non-null     int64
 7   KILOMETRAJE FINAL     50 non-null     int64
 8   CANTIDAD DIAS         50 non-null     int64
 9   MONTO                 50 non-null     int64
dtypes: int64(5), object(5)
memory usage: 4.0+ KB
None

,EDAD,GÉNERO,ACTIVIDAD,COMUNA DE RESIDENCIA,MARCA,MODELO,KILOMETRAJE INICIAL,KILOMETRAJE FINAL,CANTIDAD DIAS,MONTO
0,36,FEMENINO,DEPENDIENTE,OLMUE,FORD,ESCAPE,3201,3265,1,30000
1,29,FEMENINO,DEPENDIENTE,CASABLANCA,FORD,ESCAPE,2399,2563,4,120000
2,54,MASCULINO,DEPENDIENTE,VILLA ALEMANA,FIAT,FULLBACK,3266,3385,3,90000
3,70,MASCULINO,DEPENDIENTE,VIÑA DEL MAR,RENAULT,CAPTUR,3965,4022,1,-20000
4,39,MASCULINO,DEPENDIENTE,OLMUE,MAZDA,6,2642,2847,2,40000

,EDAD,KILOMETRAJE INICIAL,KILOMETRAJE FINAL,CANTIDAD DIAS,MONTO
count,50.000000,50.000000,50.000000,50.000000,5.000000e+01
mean,48.780000,3176.980000,3291.080000,2.840000,9.540200e+04
std,16.770102,522.549226,525.526474,1.503194,2.506898e+05
min,12.000000,2258.000000,2358.000000,1.000000,-2.000000e+04
25%,34.500000,2791.250000,2924.000000,1.000000,2.000000e+04
50%,49.000000,3195.000000,3266.000000,3.000000,5.000000e+04
75%,62.750000,3624.250000,3745.250000,4.000000,9.000000e+04
max,75.000000,4146.000000,4262.000000,5.000000,1.800000e+06